app/controllers/posts_controller.rb

INSERT INTO "posts" ("image", "active", "account_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image", "StockSnap_FXJ2DEDJC0.jpg"], ["active", true], ["account_id", 1], ["created_at", "2020-04-22 21:52:45.944911"], ["updated_at", "2020-04-22 21:52:45.944911"]]
---
  def create
    @post = Post.new(post_params)
    @post.account_id = current_account.id if account_signed_in?

    if @post.save